app/Views/master/mstore_v.php

SELECT *
FROM `store`
WHERE `store`.`store_id` = '1'
ORDER BY `store_name` ASC
---
                                </thead>
                                <tbody>
                                    <?php
                                    $usr = $this->db
                                        ->table("store")
                                        ->where("store.store_id",session()->get("store_id"))
                                        ->orderBy("store_name", "ASC")
                                        ->get();