app/Controllers/transaction/transaction.php

    public function shift()
    {
        $builder = $this->db->table("store")
            ->where("store_id", session()->get("store_id"))
            ->orderBy("store_id", "DESC")
            ->limit(1)
            ->get();
---
SELECT *
FROM `store`
WHERE `store_id` = '1'
ORDER BY `store_id` DESC
 LIMIT 1

    public function nominalkas()
    {
        $builder = $this->db->table("store")
            ->where("store_id", session()->get("store_id"))
            ->get();
---
SELECT *
FROM `store`
WHERE `store_id` = '1'

    public function modalawalkas()
    {
        $builder = $this->db->table("store")
            ->where("store_id", session()->get("store_id"))
            ->get();
---
SELECT *
FROM `store`
WHERE `store_id` = '1'

    public function listnota()
    {
        $builder = $this->db->table("transaction")
            ->where("store_id", session()->get("store_id"))
            ->where("transaction_status", $this->request->getGet("transaction_status"));
        if (isset($_GET["from"]) && $_GET["from"] != "") {
            $builder->where("transaction.transaction_date >=", $this->request->getGet("from"));
        } else {
            $builder->where("transaction.transaction_date", date("Y-m-d"));
        }

        if (isset($_GET["to"]) && $_GET["to"] != "") {
            $builder->where("transaction.transaction_date <=", $this->request->getGet("to"));
        } else {
            $builder->where("transaction.transaction_date", date("Y-m-d"));
        }
        $listnota = $builder
            ->get();
---
SELECT *
FROM `transaction`
WHERE `store_id` = '1'
AND `transaction_status` = '2'
AND `transaction`.`transaction_date` >= '2025-07-29'
AND `transaction`.`transaction_date` <= '2025-07-29'

    public function createnota()
    {
        $input["transaction_date"] = date("Y-m-d");
        $input["transaction_no"] = "POS" . date("YmdHis") . session()->get("store_id");
        $input["cashier_id"] = session()->get("user_id");
        $input["store_id"] = session()->get("store_id");
        $input["transaction_status"] = 2;
        $input["transaction_shift"] = $this->request->getGet("transaction_shift");

        $builder = $this->db->table('transaction');
        $builder->insert($input);
---
INSERT INTO `transaction` (`transaction_date`, `transaction_no`, `cashier_id`, `store_id`, `transaction_status`, `transaction_shift`) VALUES ('2025-07-29', 'POS202507291200561', '17', '1', 2, '1')

    public function pelunasan()
    {
        $account_id = $this->request->getGet("account_id");
        $transaction_id = $this->request->getGet("transaction_id");
        $transaction_no = $this->request->getGet("transaction_no");
        $transaction_dbill = $this->request->getGet("transaction_dbill");
        $transaction_bill = $this->request->getGet("transaction_bill");
        $transaction_discount = $this->request->getGet("transaction_discount");
        $transaction_pay = $this->request->getGet("transaction_pay");
        $transaction_change = $this->request->getGet("transaction_change");
        $kas_shift = $this->request->getGet("shift");
        $transaction_status = 0;

        $input["transaction_dbill"] = $transaction_dbill;
        $input["transaction_bill"] = $transaction_bill;
        $input["transaction_discount"] = $transaction_discount;
        $input["transaction_pay"] = $transaction_pay;
        $input["transaction_change"] = $transaction_change;
        $input["transaction_status"] = $transaction_status;
        $input["account_id"] = $account_id;

        $this->db->table("transaction")
            ->where("transaction_id", $transaction_id)
            ->update($input);
---
UPDATE `transaction` SET `transaction_dbill` = '16000', `transaction_bill` = '16000', `transaction_discount` = '0', `transaction_pay` = '20000', `transaction_change` = '4000', `transaction_status` = 0, `account_id` = '2'
WHERE `transaction_id` = '39043'


        //update store
        //cek kas realtime
        $store = $this->db->table("store")
            ->where("store_id", session()->get("store_id"))
            ->orderBy("store_id", "DESC")
            ->limit(1)
            ->get()
            ->getRow();
---
SELECT *
FROM `store`
WHERE `store_id` = '1'
ORDER BY `store_id` DESC
 LIMIT 1

        $input2["store_posisishift"] = 'masuk';
        $input2["store_date"] = date("Y-m-d");
        $where2["store_id"] = session()->get("store_id");
        $this->db->table("store")
            ->update($input2, $where2);
---
UPDATE `store` SET `store_kas` = 1039000, `store_shift` = '1', `store_posisishift` = 'masuk', `store_date` = '2025-07-29'
WHERE `store_id` = '1'

    public function updatestatus()
    {
        $input["transaction_status"] = $this->request->getGet("transaction_status");
        $this->db->table("transaction")
            ->where("transaction_id", $this->request->getGet("transaction_id"))
            ->update($input);
---
UPDATE `transaction` SET `transaction_status` = '0'
WHERE `transaction_id` = '39043'
SELECT *
FROM `transaction`
WHERE `transaction_id` = '39043'

                    </thead>
                    <tbody>
                        <?php
                        $usr = $this->db
                            ->table("transactiond")
                            ->select("*,SUM(transactiond_qty)AS qty, SUM(transactiond_price)AS price,")
                            ->join("product", "product.product_id=transactiond.product_id", "left")
                            ->join("unit", "unit.unit_id=product.unit_id", "left")
                            ->where("product.store_id", session()->get("store_id"))
                            ->where("transactiond.transaction_id", $this->request->getGet("transaction_id"))
                            ->groupBy("transactiond.product_id")
                            ->orderBy("product_name", "ASC")
                            ->get();
---
SELECT *, SUM(transactiond_qty)AS qty, SUM(transactiond_price)AS price
FROM `transactiond`
LEFT JOIN `product` ON `product`.`product_id`=`transactiond`.`product_id`
LEFT JOIN `unit` ON `unit`.`unit_id`=`product`.`unit_id`
WHERE `product`.`store_id` = '1'
AND `transactiond`.`transaction_id` = '39044'
GROUP BY `transactiond`.`product_id`
ORDER BY `product_name` ASC

                                <td class="text-small0"><?= number_format($price, 0, ",", ".") ?></td>
                            </tr>
                        <?php }
                        $discount = $this->db->table("discount")->where("positionm_id", $positionm_id)->get();
---
SELECT *
FROM `discount`
WHERE `positionm_id` = '2'