app/Views/transaction/transactionprint_v.php

SELECT *
FROM `store`
WHERE `store_id` = '1'
SELECT *
FROM `transaction`
WHERE `transaction_id` = '39043'
---
.border{border:black solid 1px;}
</style>
<?php
$store=$this->db->table("store")->where("store_id",session()->get("store_id"))->get()->getRow();
$builder=$this->db->table("transaction")
->where("transaction_id",$this->request->getGet("transaction_id"));
$transaction=$builder->get();

SELECT *, SUM(transactiond_qty)AS qty, SUM(transactiond_price)AS price
FROM `transactiond`
LEFT JOIN `product` ON `product`.`product_id`=`transactiond`.`product_id`
LEFT JOIN `unit` ON `unit`.`unit_id`=`product`.`unit_id`
WHERE `product`.`store_id` = '1'
AND `transactiond`.`transaction_id` = '39043'
GROUP BY `transactiond`.`product_id`
ORDER BY `product_name` ASC
---
                    </thead>
                    <tbody>
                        <?php
                        $usr = $this->db
                            ->table("transactiond")
                            ->select("*,SUM(transactiond_qty)AS qty, SUM(transactiond_price)AS price,")
                            ->join("product", "product.product_id=transactiond.product_id", "left")
                            ->join("unit", "unit.unit_id=product.unit_id", "left")
                            ->where("product.store_id",session()->get("store_id"))
                            ->where("transactiond.transaction_id",$this->request->getGet("transaction_id"))
                            ->groupBy("transactiond.product_id")
                            ->orderBy("product_name", "ASC")
                            ->get();